Wiznet/esp_wiz_toe/examples/w6300_loopback/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# Conservative bring-up clock; raise after verifying signal integrity on hardware.
# --- wsm_driver shared settings (copied from loopback) ---
CONFIG_WSM_DRIVER_ENABLED=y
# Board fixes the chip (W6300) and the SPI pins together; the chip is not
# separately selectable unless the board is Custom.
CONFIG_WSM_DRIVER_BOARD_W6300_DEVKIT=y
# pins/clock/QSPI come from the board selected above
